tutorials/Wedge-HeatExchange-5ms/0/FLUID/CH4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.25;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.25;
    }
    outlet
    {
        type            zeroGradient;
    }
    "(exteriorWall|walls)"
    {
        type            zeroGradient; 
    }
    center
    {
        type            symmetryPlane;
    }
    "frontAndBack_.*"
    {
        type            wedge;
    }   
}


// ************************************************************************* //
